Anyc-Qing/AUTOSAR/core/system/Os/osal/tricore/aurix/TC39x_Source/IFX_base_famework/BaseFramework_TC39xA/0_Src/BaseSw/Sfr_39A/_Reg/IfxLmu_reg.h
/**
 * \file IfxLmu_reg.h
 * \brief
 * \copyright Copyright (c) 2015 Infineon Technologies AG. All rights reserved.
 *
 * Version: lmu_aurixplus_its_MCSFR.xml dated 29.04.2015
 * Specification: TBD
 * MAY BE CHANGED BY USER [yes/no]: No
 *
 *                                 IMPORTANT NOTICE
 *
 * Infineon Technologies AG (Infineon) is supplying this file for use
 * exclusively with Infineon's microcontroller products. This file can be freely
 * distributed within development tools that are supporting such microcontroller
 * products.
 *
 * THIS SOFTWARE IS PROVIDED "AS IS".  NO WARRANTIES, WHETHER EXPRESS, IMPLIED
 * OR STATUTORY, INCLUDING, BUT NOT LIMITED TO, IMPLIED WARRANTIES OF
 * MERCHANTABILITY AND FITNESS FOR A PARTICULAR PURPOSE APPLY TO THIS SOFTWARE.
 * INFINEON SHALL NOT, IN ANY CIRCUMSTANCES, BE LIABLE FOR SPECIAL, INCIDENTAL,
 * OR CONSEQUENTIAL DAMAGES, FOR ANY REASON WHATSOEVER.
 *
 * \defgroup IfxLld_Lmu_Cfg Lmu address
 * \ingroup IfxLld_Lmu
 * 
 * \defgroup IfxLld_Lmu_Cfg_BaseAddress Base address
 * \ingroup IfxLld_Lmu_Cfg
 * 
 * \defgroup IfxLld_Lmu_Cfg_Lmu0 2-LMU0
 * \ingroup IfxLld_Lmu_Cfg
 * 
 * \defgroup IfxLld_Lmu_Cfg_Lmu1 2-LMU1
 * \ingroup IfxLld_Lmu_Cfg
 * 
 * \defgroup IfxLld_Lmu_Cfg_Lmu2 2-LMU2
 * \ingroup IfxLld_Lmu_Cfg
 * 
 * \defgroup IfxLld_Lmu_Cfg_Lmu3 2-LMU3
 * \ingroup IfxLld_Lmu_Cfg
 * 
 */
#ifndef IFXLMU_REG_H
#define IFXLMU_REG_H 1
/******************************************************************************/
#include "IfxLmu_regdef.h"
/******************************************************************************/
/** \addtogroup IfxLld_Lmu_Cfg_BaseAddress
 * \{  */

/** \\brief  LMU object */
#define MODULE_LMU0 /*lint --e(923)*/ ((*(Ifx_LMU*)0xF8100000u))

/** \\brief  LMU object */
#define MODULE_LMU1 /*lint --e(923)*/ ((*(Ifx_LMU*)0xF8110000u))

/** \\brief  LMU object */
#define MODULE_LMU2 /*lint --e(923)*/ ((*(Ifx_LMU*)0xF8120000u))

/** \\brief  LMU object */
#define MODULE_LMU3 /*lint --e(923)*/ ((*(Ifx_LMU*)0xF8130000u))
/** \}  */
/******************************************************************************/
/******************************************************************************/
/** \addtogroup IfxLld_Lmu_Cfg_Lmu0
 * \{  */

/** \\brief  10, LMUAccess Enable Register 0 */
#define LMU0_ACCEN0 /*lint --e(923)*/ (*(volatile Ifx_LMU_ACCEN0*)0xF8100010u)

/** \\brief  14, LMUAccess Enable Register 1 */
#define LMU0_ACCEN1 /*lint --e(923)*/ (*(volatile Ifx_LMU_ACCEN1*)0xF8100014u)

/** \\brief  0, LMUClock Control Register */
#define LMU0_CLC /*lint --e(923)*/ (*(volatile Ifx_LMU_CLC*)0xF8100000u)

/** \\brief  20, LMUMemory Control Register */
#define LMU0_MEMCON /*lint --e(923)*/ (*(volatile Ifx_LMU_MEMCON*)0xF8100020u)

/** \\brief  8, LMUModule ID Register */
#define LMU0_MODID /*lint --e(923)*/ (*(volatile Ifx_LMU_MODID*)0xF8100008u)

/** \\brief  58, LMURegion Access Enable Register */
#define LMU0_RGN0_ACCENWA /*lint --e(923)*/ (*(volatile Ifx_LMU_RGN_ACCENWA*)0xF8100058u)

/** \\brief  5C, LMURegion Access Enable Register */
#define LMU0_RGN0_ACCENWB /*lint --e(923)*/ (*(volatile Ifx_LMU_RGN_ACCENWB*)0xF810005Cu)

/** \\brief  50, LMURegion Lower Address Register */
#define LMU0_RGN0_LA /*lint --e(923)*/ (*(volatile Ifx_LMU_RGN_LA*)0xF8100050u)

/** \\brief  54, LMURegion Upper Address Register */
#define LMU0_RGN0_UA /*lint --e(923)*/ (*(volatile Ifx_LMU_RGN_UA*)0xF8100054u)

/** \\brief  68, LMURegion Access Enable Register */
#define LMU0_RGN1_ACCENWA /*lint --e(923)*/ (*(volatile Ifx_LMU_RGN_ACCENWA*)0xF8100068u)

/** \\brief  6C, LMURegion Access Enable Register */
#define LMU0_RGN1_ACCENWB /*lint --e(923)*/ (*(volatile Ifx_LMU_RGN_ACCENWB*)0xF810006Cu)

/** \\brief  60, LMURegion Lower Address Register */
#define LMU0_RGN1_LA /*lint --e(923)*/ (*(volatile Ifx_LMU_RGN_LA*)0xF8100060u)

/** \\brief  64, LMURegion Upper Address Register */
#define LMU0_RGN1_UA /*lint --e(923)*/ (*(volatile Ifx_LMU_RGN_UA*)0xF8100064u)

/** \\brief  78, LMURegion Access Enable Register */
#define LMU0_RGN2_ACCENWA /*lint --e(923)*/ (*(volatile Ifx_LMU_RGN_ACCENWA*)0xF8100078u)

/** \\brief  7C, LMURegion Access Enable Register */
#define LMU0_RGN2_ACCENWB /*lint --e(923)*/ (*(volatile Ifx_LMU_RGN_ACCENWB*)0xF810007Cu)

/** \\brief  70, LMURegion Lower Address Register */
#define LMU0_RGN2_LA /*lint --e(923)*/ (*(volatile Ifx_LMU_RGN_LA*)0xF8100070u)

/** \\brief  74, LMURegion Upper Address Register */
#define LMU0_RGN2_UA /*lint --e(923)*/ (*(volatile Ifx_LMU_RGN_UA*)0xF8100074u)

/** \\brief  88, LMURegion Access Enable Register */
#define LMU0_RGN3_ACCENWA /*lint --e(923)*/ (*(volatile Ifx_LMU_RGN_ACCENWA*)0xF8100088u)

/** \\brief  8C, LMURegion Access Enable Register */
#define LMU0_RGN3_ACCENWB /*lint --e(923)*/ (*(volatile Ifx_LMU_RGN_ACCENWB*)0xF810008Cu)

/** \\brief  80, LMURegion Lower Address Register */
#define LMU0_RGN3_LA /*lint --e(923)*/ (*(volatile Ifx_LMU_RGN_LA*)0xF8100080u)

/** \\brief  84, LMURegion Upper Address Register */
#define LMU0_RGN3_UA /*lint --e(923)*/ (*(volatile Ifx_LMU_RGN_UA*)0xF8100084u)

/** \\brief  98, LMURegion Access Enable Register */
#define LMU0_RGN4_ACCENWA /*lint --e(923)*/ (*(volatile Ifx_LMU_RGN_ACCENWA*)0xF8100098u)

/** \\brief  9C, LMURegion Access Enable Register */
#define LMU0_RGN4_ACCENWB /*lint --e(923)*/ (*(volatile Ifx_LMU_RGN_ACCENWB*)0xF810009Cu)

/** \\brief  90, LMURegion Lower Address Register */
#define LMU0_RGN4_LA /*lint --e(923)*/ (*(volatile Ifx_LMU_RGN_LA*)0xF8100090u)

/** \\brief  94, LMURegion Upper Address Register */
#define LMU0_RGN4_UA /*lint --e(923)*/ (*(volatile Ifx_LMU_RGN_UA*)0xF8100094u)

/** \\brief  A8, LMURegion Access Enable Register */
#define LMU0_RGN5_ACCENWA /*lint --e(923)*/ (*(volatile Ifx_LMU_RGN_ACCENWA*)0xF81000A8u)

/** \\brief  AC, LMURegion Access Enable Register */
#define LMU0_RGN5_ACCENWB /*lint --e(923)*/ (*(volatile Ifx_LMU_RGN_ACCENWB*)0xF81000ACu)

/** \\brief  A0, LMURegion Lower Address Register */
#define LMU0_RGN5_LA /*lint --e(923)*/ (*(volatile Ifx_LMU_RGN_LA*)0xF81000A0u)

/** \\brief  A4, LMURegion Upper Address Register */
#define LMU0_RGN5_UA /*lint --e(923)*/ (*(volatile Ifx_LMU_RGN_UA*)0xF81000A4u)

/** \\brief  B8, LMURegion Access Enable Register */
#define LMU0_RGN6_ACCENWA /*lint --e(923)*/ (*(volatile Ifx_LMU_RGN_ACCENWA*)0xF81000B8u)

/** \\brief  BC, LMURegion Access Enable Register */
#define LMU0_RGN6_ACCENWB /*lint --e(923)*/ (*(volatile Ifx_LMU_RGN_ACCENWB*)0xF81000BCu)

