Anyc-Qing/AUTOSAR/core/system/Os/osal/tricore/aurix/TC39x_Source/IFX_base_famework/BaseFramework_TC39xA/0_Src/BaseSw/Sfr_39A/_Reg/IfxLmu_reg.h
/** \\brief  B0, LMURegion Lower Address Register */
#define LMU0_RGN6_LA /*lint --e(923)*/ (*(volatile Ifx_LMU_RGN_LA*)0xF81000B0u)

/** \\brief  B4, LMURegion Upper Address Register */
#define LMU0_RGN6_UA /*lint --e(923)*/ (*(volatile Ifx_LMU_RGN_UA*)0xF81000B4u)

/** \\brief  C8, LMURegion Access Enable Register */
#define LMU0_RGN7_ACCENWA /*lint --e(923)*/ (*(volatile Ifx_LMU_RGN_ACCENWA*)0xF81000C8u)

/** \\brief  CC, LMURegion Access Enable Register */
#define LMU0_RGN7_ACCENWB /*lint --e(923)*/ (*(volatile Ifx_LMU_RGN_ACCENWB*)0xF81000CCu)

/** \\brief  C0, LMURegion Lower Address Register */
#define LMU0_RGN7_LA /*lint --e(923)*/ (*(volatile Ifx_LMU_RGN_LA*)0xF81000C0u)

/** \\brief  C4, LMURegion Upper Address Register */
#define LMU0_RGN7_UA /*lint --e(923)*/ (*(volatile Ifx_LMU_RGN_UA*)0xF81000C4u)

/** \\brief  D8, LMURegion Access Enable Register 0 */
#define LMU0_RGNACCEN0_RA /*lint --e(923)*/ (*(volatile Ifx_LMU_RGNACCEN_RA*)0xF81000D8u)

/** \\brief  E8, LMURegion Access Enable Register 0 */
#define LMU0_RGNACCEN1_RA /*lint --e(923)*/ (*(volatile Ifx_LMU_RGNACCEN_RA*)0xF81000E8u)

/** \\brief  F8, LMURegion Access Enable Register 0 */
#define LMU0_RGNACCEN2_RA /*lint --e(923)*/ (*(volatile Ifx_LMU_RGNACCEN_RA*)0xF81000F8u)

/** \\brief  108, LMURegion Access Enable Register 0 */
#define LMU0_RGNACCEN3_RA /*lint --e(923)*/ (*(volatile Ifx_LMU_RGNACCEN_RA*)0xF8100108u)

/** \\brief  118, LMURegion Access Enable Register 0 */
#define LMU0_RGNACCEN4_RA /*lint --e(923)*/ (*(volatile Ifx_LMU_RGNACCEN_RA*)0xF8100118u)

/** \\brief  128, LMURegion Access Enable Register 0 */
#define LMU0_RGNACCEN5_RA /*lint --e(923)*/ (*(volatile Ifx_LMU_RGNACCEN_RA*)0xF8100128u)

/** \\brief  138, LMURegion Access Enable Register 0 */
#define LMU0_RGNACCEN6_RA /*lint --e(923)*/ (*(volatile Ifx_LMU_RGNACCEN_RA*)0xF8100138u)

/** \\brief  148, LMURegion Access Enable Register 0 */
#define LMU0_RGNACCEN7_RA /*lint --e(923)*/ (*(volatile Ifx_LMU_RGNACCEN_RA*)0xF8100148u)

/** \\brief  DC, LMURegion Access Enable Register 1 */
#define LMU0_RGNACCEN0_RB /*lint --e(923)*/ (*(volatile Ifx_LMU_RGNACCEN_RB*)0xF81000DCu)

/** \\brief  EC, LMURegion Access Enable Register 1 */
#define LMU0_RGNACCEN1_RB /*lint --e(923)*/ (*(volatile Ifx_LMU_RGNACCEN_RB*)0xF81000ECu)

/** \\brief  FC, LMURegion Access Enable Register 1 */
#define LMU0_RGNACCEN2_RB /*lint --e(923)*/ (*(volatile Ifx_LMU_RGNACCEN_RB*)0xF81000FCu)

/** \\brief  10C, LMURegion Access Enable Register 1 */
#define LMU0_RGNACCEN3_RB /*lint --e(923)*/ (*(volatile Ifx_LMU_RGNACCEN_RB*)0xF810010Cu)

/** \\brief  11C, LMURegion Access Enable Register 1 */
#define LMU0_RGNACCEN4_RB /*lint --e(923)*/ (*(volatile Ifx_LMU_RGNACCEN_RB*)0xF810011Cu)

/** \\brief  12C, LMURegion Access Enable Register 1 */
#define LMU0_RGNACCEN5_RB /*lint --e(923)*/ (*(volatile Ifx_LMU_RGNACCEN_RB*)0xF810012Cu)

/** \\brief  13C, LMURegion Access Enable Register 1 */
#define LMU0_RGNACCEN6_RB /*lint --e(923)*/ (*(volatile Ifx_LMU_RGNACCEN_RB*)0xF810013Cu)

/** \\brief  14C, LMURegion Access Enable Register 1 */
#define LMU0_RGNACCEN7_RB /*lint --e(923)*/ (*(volatile Ifx_LMU_RGNACCEN_RB*)0xF810014Cu)

/** \\brief  24, LMUSafety Control Register */
#define LMU0_SCTRL /*lint --e(923)*/ (*(volatile Ifx_LMU_SCTRL*)0xF8100024u)
/** \}  */
/******************************************************************************/
/******************************************************************************/
/** \addtogroup IfxLld_Lmu_Cfg_Lmu1
 * \{  */

/** \\brief  10, LMUAccess Enable Register 0 */
#define LMU1_ACCEN0 /*lint --e(923)*/ (*(volatile Ifx_LMU_ACCEN0*)0xF8110010u)

/** \\brief  14, LMUAccess Enable Register 1 */
#define LMU1_ACCEN1 /*lint --e(923)*/ (*(volatile Ifx_LMU_ACCEN1*)0xF8110014u)

/** \\brief  0, LMUClock Control Register */
#define LMU1_CLC /*lint --e(923)*/ (*(volatile Ifx_LMU_CLC*)0xF8110000u)

/** \\brief  20, LMUMemory Control Register */
#define LMU1_MEMCON /*lint --e(923)*/ (*(volatile Ifx_LMU_MEMCON*)0xF8110020u)

/** \\brief  8, LMUModule ID Register */
#define LMU1_MODID /*lint --e(923)*/ (*(volatile Ifx_LMU_MODID*)0xF8110008u)

/** \\brief  58, LMURegion Access Enable Register */
#define LMU1_RGN0_ACCENWA /*lint --e(923)*/ (*(volatile Ifx_LMU_RGN_ACCENWA*)0xF8110058u)

/** \\brief  5C, LMURegion Access Enable Register */
#define LMU1_RGN0_ACCENWB /*lint --e(923)*/ (*(volatile Ifx_LMU_RGN_ACCENWB*)0xF811005Cu)

/** \\brief  50, LMURegion Lower Address Register */
#define LMU1_RGN0_LA /*lint --e(923)*/ (*(volatile Ifx_LMU_RGN_LA*)0xF8110050u)

/** \\brief  54, LMURegion Upper Address Register */
#define LMU1_RGN0_UA /*lint --e(923)*/ (*(volatile Ifx_LMU_RGN_UA*)0xF8110054u)

/** \\brief  68, LMURegion Access Enable Register */
#define LMU1_RGN1_ACCENWA /*lint --e(923)*/ (*(volatile Ifx_LMU_RGN_ACCENWA*)0xF8110068u)

/** \\brief  6C, LMURegion Access Enable Register */
#define LMU1_RGN1_ACCENWB /*lint --e(923)*/ (*(volatile Ifx_LMU_RGN_ACCENWB*)0xF811006Cu)

/** \\brief  60, LMURegion Lower Address Register */
#define LMU1_RGN1_LA /*lint --e(923)*/ (*(volatile Ifx_LMU_RGN_LA*)0xF8110060u)

/** \\brief  64, LMURegion Upper Address Register */
#define LMU1_RGN1_UA /*lint --e(923)*/ (*(volatile Ifx_LMU_RGN_UA*)0xF8110064u)

/** \\brief  78, LMURegion Access Enable Register */
#define LMU1_RGN2_ACCENWA /*lint --e(923)*/ (*(volatile Ifx_LMU_RGN_ACCENWA*)0xF8110078u)

/** \\brief  7C, LMURegion Access Enable Register */
#define LMU1_RGN2_ACCENWB /*lint --e(923)*/ (*(volatile Ifx_LMU_RGN_ACCENWB*)0xF811007Cu)

/** \\brief  70, LMURegion Lower Address Register */
#define LMU1_RGN2_LA /*lint --e(923)*/ (*(volatile Ifx_LMU_RGN_LA*)0xF8110070u)

/** \\brief  74, LMURegion Upper Address Register */
#define LMU1_RGN2_UA /*lint --e(923)*/ (*(volatile Ifx_LMU_RGN_UA*)0xF8110074u)

/** \\brief  88, LMURegion Access Enable Register */
#define LMU1_RGN3_ACCENWA /*lint --e(923)*/ (*(volatile Ifx_LMU_RGN_ACCENWA*)0xF8110088u)

/** \\brief  8C, LMURegion Access Enable Register */
#define LMU1_RGN3_ACCENWB /*lint --e(923)*/ (*(volatile Ifx_LMU_RGN_ACCENWB*)0xF811008Cu)

/** \\brief  80, LMURegion Lower Address Register */
#define LMU1_RGN3_LA /*lint --e(923)*/ (*(volatile Ifx_LMU_RGN_LA*)0xF8110080u)

/** \\brief  84, LMURegion Upper Address Register */
#define LMU1_RGN3_UA /*lint --e(923)*/ (*(volatile Ifx_LMU_RGN_UA*)0xF8110084u)

