Anyc-Qing/AUTOSAR/core/system/Os/osal/tricore/aurix/TC39x_Source/IFX_base_famework/BaseFramework_TC39xA/0_Src/BaseSw/Sfr_39A/_Reg/IfxLmu_reg.h
/** \\brief  98, LMURegion Access Enable Register */
#define LMU1_RGN4_ACCENWA /*lint --e(923)*/ (*(volatile Ifx_LMU_RGN_ACCENWA*)0xF8110098u)

/** \\brief  9C, LMURegion Access Enable Register */
#define LMU1_RGN4_ACCENWB /*lint --e(923)*/ (*(volatile Ifx_LMU_RGN_ACCENWB*)0xF811009Cu)

/** \\brief  90, LMURegion Lower Address Register */
#define LMU1_RGN4_LA /*lint --e(923)*/ (*(volatile Ifx_LMU_RGN_LA*)0xF8110090u)

/** \\brief  94, LMURegion Upper Address Register */
#define LMU1_RGN4_UA /*lint --e(923)*/ (*(volatile Ifx_LMU_RGN_UA*)0xF8110094u)

/** \\brief  A8, LMURegion Access Enable Register */
#define LMU1_RGN5_ACCENWA /*lint --e(923)*/ (*(volatile Ifx_LMU_RGN_ACCENWA*)0xF81100A8u)

/** \\brief  AC, LMURegion Access Enable Register */
#define LMU1_RGN5_ACCENWB /*lint --e(923)*/ (*(volatile Ifx_LMU_RGN_ACCENWB*)0xF81100ACu)

/** \\brief  A0, LMURegion Lower Address Register */
#define LMU1_RGN5_LA /*lint --e(923)*/ (*(volatile Ifx_LMU_RGN_LA*)0xF81100A0u)

/** \\brief  A4, LMURegion Upper Address Register */
#define LMU1_RGN5_UA /*lint --e(923)*/ (*(volatile Ifx_LMU_RGN_UA*)0xF81100A4u)

/** \\brief  B8, LMURegion Access Enable Register */
#define LMU1_RGN6_ACCENWA /*lint --e(923)*/ (*(volatile Ifx_LMU_RGN_ACCENWA*)0xF81100B8u)

/** \\brief  BC, LMURegion Access Enable Register */
#define LMU1_RGN6_ACCENWB /*lint --e(923)*/ (*(volatile Ifx_LMU_RGN_ACCENWB*)0xF81100BCu)

/** \\brief  B0, LMURegion Lower Address Register */
#define LMU1_RGN6_LA /*lint --e(923)*/ (*(volatile Ifx_LMU_RGN_LA*)0xF81100B0u)

/** \\brief  B4, LMURegion Upper Address Register */
#define LMU1_RGN6_UA /*lint --e(923)*/ (*(volatile Ifx_LMU_RGN_UA*)0xF81100B4u)

/** \\brief  C8, LMURegion Access Enable Register */
#define LMU1_RGN7_ACCENWA /*lint --e(923)*/ (*(volatile Ifx_LMU_RGN_ACCENWA*)0xF81100C8u)

/** \\brief  CC, LMURegion Access Enable Register */
#define LMU1_RGN7_ACCENWB /*lint --e(923)*/ (*(volatile Ifx_LMU_RGN_ACCENWB*)0xF81100CCu)

/** \\brief  C0, LMURegion Lower Address Register */
#define LMU1_RGN7_LA /*lint --e(923)*/ (*(volatile Ifx_LMU_RGN_LA*)0xF81100C0u)

/** \\brief  C4, LMURegion Upper Address Register */
#define LMU1_RGN7_UA /*lint --e(923)*/ (*(volatile Ifx_LMU_RGN_UA*)0xF81100C4u)

/** \\brief  D8, LMURegion Access Enable Register 0 */
#define LMU1_RGNACCEN0_RA /*lint --e(923)*/ (*(volatile Ifx_LMU_RGNACCEN_RA*)0xF81100D8u)

/** \\brief  E8, LMURegion Access Enable Register 0 */
#define LMU1_RGNACCEN1_RA /*lint --e(923)*/ (*(volatile Ifx_LMU_RGNACCEN_RA*)0xF81100E8u)

/** \\brief  F8, LMURegion Access Enable Register 0 */
#define LMU1_RGNACCEN2_RA /*lint --e(923)*/ (*(volatile Ifx_LMU_RGNACCEN_RA*)0xF81100F8u)

/** \\brief  108, LMURegion Access Enable Register 0 */
#define LMU1_RGNACCEN3_RA /*lint --e(923)*/ (*(volatile Ifx_LMU_RGNACCEN_RA*)0xF8110108u)

/** \\brief  118, LMURegion Access Enable Register 0 */
#define LMU1_RGNACCEN4_RA /*lint --e(923)*/ (*(volatile Ifx_LMU_RGNACCEN_RA*)0xF8110118u)

/** \\brief  128, LMURegion Access Enable Register 0 */
#define LMU1_RGNACCEN5_RA /*lint --e(923)*/ (*(volatile Ifx_LMU_RGNACCEN_RA*)0xF8110128u)

/** \\brief  138, LMURegion Access Enable Register 0 */
#define LMU1_RGNACCEN6_RA /*lint --e(923)*/ (*(volatile Ifx_LMU_RGNACCEN_RA*)0xF8110138u)

/** \\brief  148, LMURegion Access Enable Register 0 */
#define LMU1_RGNACCEN7_RA /*lint --e(923)*/ (*(volatile Ifx_LMU_RGNACCEN_RA*)0xF8110148u)

/** \\brief  DC, LMURegion Access Enable Register 1 */
#define LMU1_RGNACCEN0_RB /*lint --e(923)*/ (*(volatile Ifx_LMU_RGNACCEN_RB*)0xF81100DCu)

/** \\brief  EC, LMURegion Access Enable Register 1 */
#define LMU1_RGNACCEN1_RB /*lint --e(923)*/ (*(volatile Ifx_LMU_RGNACCEN_RB*)0xF81100ECu)

/** \\brief  FC, LMURegion Access Enable Register 1 */
#define LMU1_RGNACCEN2_RB /*lint --e(923)*/ (*(volatile Ifx_LMU_RGNACCEN_RB*)0xF81100FCu)

/** \\brief  10C, LMURegion Access Enable Register 1 */
#define LMU1_RGNACCEN3_RB /*lint --e(923)*/ (*(volatile Ifx_LMU_RGNACCEN_RB*)0xF811010Cu)

/** \\brief  11C, LMURegion Access Enable Register 1 */
#define LMU1_RGNACCEN4_RB /*lint --e(923)*/ (*(volatile Ifx_LMU_RGNACCEN_RB*)0xF811011Cu)

/** \\brief  12C, LMURegion Access Enable Register 1 */
#define LMU1_RGNACCEN5_RB /*lint --e(923)*/ (*(volatile Ifx_LMU_RGNACCEN_RB*)0xF811012Cu)

/** \\brief  13C, LMURegion Access Enable Register 1 */
#define LMU1_RGNACCEN6_RB /*lint --e(923)*/ (*(volatile Ifx_LMU_RGNACCEN_RB*)0xF811013Cu)

/** \\brief  14C, LMURegion Access Enable Register 1 */
#define LMU1_RGNACCEN7_RB /*lint --e(923)*/ (*(volatile Ifx_LMU_RGNACCEN_RB*)0xF811014Cu)

/** \\brief  24, LMUSafety Control Register */
#define LMU1_SCTRL /*lint --e(923)*/ (*(volatile Ifx_LMU_SCTRL*)0xF8110024u)

/** \}  */
/******************************************************************************/
/******************************************************************************/
/** \addtogroup IfxLld_Lmu_Cfg_Lmu2
 * \{  */

/** \\brief  10, LMUAccess Enable Register 0 */
#define LMU2_ACCEN0 /*lint --e(923)*/ (*(volatile Ifx_LMU_ACCEN0*)0xF8120010u)

/** \\brief  14, LMUAccess Enable Register 1 */
#define LMU2_ACCEN1 /*lint --e(923)*/ (*(volatile Ifx_LMU_ACCEN1*)0xF8120014u)

/** \\brief  0, LMUClock Control Register */
#define LMU2_CLC /*lint --e(923)*/ (*(volatile Ifx_LMU_CLC*)0xF8120000u)

/** \\brief  20, LMUMemory Control Register */
#define LMU2_MEMCON /*lint --e(923)*/ (*(volatile Ifx_LMU_MEMCON*)0xF8120020u)

/** \\brief  8, LMUModule ID Register */
#define LMU2_MODID /*lint --e(923)*/ (*(volatile Ifx_LMU_MODID*)0xF8120008u)

/** \\brief  58, LMURegion Access Enable Register */
#define LMU2_RGN0_ACCENWA /*lint --e(923)*/ (*(volatile Ifx_LMU_RGN_ACCENWA*)0xF8120058u)

/** \\brief  5C, LMURegion Access Enable Register */
#define LMU2_RGN0_ACCENWB /*lint --e(923)*/ (*(volatile Ifx_LMU_RGN_ACCENWB*)0xF812005Cu)

/** \\brief  50, LMURegion Lower Address Register */
#define LMU2_RGN0_LA /*lint --e(923)*/ (*(volatile Ifx_LMU_RGN_LA*)0xF8120050u)

/** \\brief  54, LMURegion Upper Address Register */
#define LMU2_RGN0_UA /*lint --e(923)*/ (*(volatile Ifx_LMU_RGN_UA*)0xF8120054u)

/** \\brief  68, LMURegion Access Enable Register */
#define LMU2_RGN1_ACCENWA /*lint --e(923)*/ (*(volatile Ifx_LMU_RGN_ACCENWA*)0xF8120068u)

/** \\brief  6C, LMURegion Access Enable Register */
#define LMU2_RGN1_ACCENWB /*lint --e(923)*/ (*(volatile Ifx_LMU_RGN_ACCENWB*)0xF812006Cu)

/** \\brief  60, LMURegion Lower Address Register */
#define LMU2_RGN1_LA /*lint --e(923)*/ (*(volatile Ifx_LMU_RGN_LA*)0xF8120060u)

/** \\brief  64, LMURegion Upper Address Register */
#define LMU2_RGN1_UA /*lint --e(923)*/ (*(volatile Ifx_LMU_RGN_UA*)0xF8120064u)

