Anyc-Qing/AUTOSAR/core/system/Os/osal/tricore/aurix/TC39x_Source/IFX_base_famework/BaseFramework_TC39xA/0_Src/BaseSw/Sfr_39A/_Reg/IfxLmu_reg.h
/** \\brief  78, LMURegion Access Enable Register */
#define LMU2_RGN2_ACCENWA /*lint --e(923)*/ (*(volatile Ifx_LMU_RGN_ACCENWA*)0xF8120078u)

/** \\brief  7C, LMURegion Access Enable Register */
#define LMU2_RGN2_ACCENWB /*lint --e(923)*/ (*(volatile Ifx_LMU_RGN_ACCENWB*)0xF812007Cu)

/** \\brief  70, LMURegion Lower Address Register */
#define LMU2_RGN2_LA /*lint --e(923)*/ (*(volatile Ifx_LMU_RGN_LA*)0xF8120070u)

/** \\brief  74, LMURegion Upper Address Register */
#define LMU2_RGN2_UA /*lint --e(923)*/ (*(volatile Ifx_LMU_RGN_UA*)0xF8120074u)

/** \\brief  88, LMURegion Access Enable Register */
#define LMU2_RGN3_ACCENWA /*lint --e(923)*/ (*(volatile Ifx_LMU_RGN_ACCENWA*)0xF8120088u)

/** \\brief  8C, LMURegion Access Enable Register */
#define LMU2_RGN3_ACCENWB /*lint --e(923)*/ (*(volatile Ifx_LMU_RGN_ACCENWB*)0xF812008Cu)

/** \\brief  80, LMURegion Lower Address Register */
#define LMU2_RGN3_LA /*lint --e(923)*/ (*(volatile Ifx_LMU_RGN_LA*)0xF8120080u)

/** \\brief  84, LMURegion Upper Address Register */
#define LMU2_RGN3_UA /*lint --e(923)*/ (*(volatile Ifx_LMU_RGN_UA*)0xF8120084u)

/** \\brief  98, LMURegion Access Enable Register */
#define LMU2_RGN4_ACCENWA /*lint --e(923)*/ (*(volatile Ifx_LMU_RGN_ACCENWA*)0xF8120098u)

/** \\brief  9C, LMURegion Access Enable Register */
#define LMU2_RGN4_ACCENWB /*lint --e(923)*/ (*(volatile Ifx_LMU_RGN_ACCENWB*)0xF812009Cu)

/** \\brief  90, LMURegion Lower Address Register */
#define LMU2_RGN4_LA /*lint --e(923)*/ (*(volatile Ifx_LMU_RGN_LA*)0xF8120090u)

/** \\brief  94, LMURegion Upper Address Register */
#define LMU2_RGN4_UA /*lint --e(923)*/ (*(volatile Ifx_LMU_RGN_UA*)0xF8120094u)

/** \\brief  A8, LMURegion Access Enable Register */
#define LMU2_RGN5_ACCENWA /*lint --e(923)*/ (*(volatile Ifx_LMU_RGN_ACCENWA*)0xF81200A8u)

/** \\brief  AC, LMURegion Access Enable Register */
#define LMU2_RGN5_ACCENWB /*lint --e(923)*/ (*(volatile Ifx_LMU_RGN_ACCENWB*)0xF81200ACu)

/** \\brief  A0, LMURegion Lower Address Register */
#define LMU2_RGN5_LA /*lint --e(923)*/ (*(volatile Ifx_LMU_RGN_LA*)0xF81200A0u)

/** \\brief  A4, LMURegion Upper Address Register */
#define LMU2_RGN5_UA /*lint --e(923)*/ (*(volatile Ifx_LMU_RGN_UA*)0xF81200A4u)

/** \\brief  B8, LMURegion Access Enable Register */
#define LMU2_RGN6_ACCENWA /*lint --e(923)*/ (*(volatile Ifx_LMU_RGN_ACCENWA*)0xF81200B8u)

/** \\brief  BC, LMURegion Access Enable Register */
#define LMU2_RGN6_ACCENWB /*lint --e(923)*/ (*(volatile Ifx_LMU_RGN_ACCENWB*)0xF81200BCu)

/** \\brief  B0, LMURegion Lower Address Register */
#define LMU2_RGN6_LA /*lint --e(923)*/ (*(volatile Ifx_LMU_RGN_LA*)0xF81200B0u)

/** \\brief  B4, LMURegion Upper Address Register */
#define LMU2_RGN6_UA /*lint --e(923)*/ (*(volatile Ifx_LMU_RGN_UA*)0xF81200B4u)

/** \\brief  C8, LMURegion Access Enable Register */
#define LMU2_RGN7_ACCENWA /*lint --e(923)*/ (*(volatile Ifx_LMU_RGN_ACCENWA*)0xF81200C8u)

/** \\brief  CC, LMURegion Access Enable Register */
#define LMU2_RGN7_ACCENWB /*lint --e(923)*/ (*(volatile Ifx_LMU_RGN_ACCENWB*)0xF81200CCu)

/** \\brief  C0, LMURegion Lower Address Register */
#define LMU2_RGN7_LA /*lint --e(923)*/ (*(volatile Ifx_LMU_RGN_LA*)0xF81200C0u)

/** \\brief  C4, LMURegion Upper Address Register */
#define LMU2_RGN7_UA /*lint --e(923)*/ (*(volatile Ifx_LMU_RGN_UA*)0xF81200C4u)

/** \\brief  D8, LMURegion Access Enable Register 0 */
#define LMU2_RGNACCEN0_RA /*lint --e(923)*/ (*(volatile Ifx_LMU_RGNACCEN_RA*)0xF81200D8u)

/** \\brief  E8, LMURegion Access Enable Register 0 */
#define LMU2_RGNACCEN1_RA /*lint --e(923)*/ (*(volatile Ifx_LMU_RGNACCEN_RA*)0xF81200E8u)

/** \\brief  F8, LMURegion Access Enable Register 0 */
#define LMU2_RGNACCEN2_RA /*lint --e(923)*/ (*(volatile Ifx_LMU_RGNACCEN_RA*)0xF81200F8u)

/** \\brief  108, LMURegion Access Enable Register 0 */
#define LMU2_RGNACCEN3_RA /*lint --e(923)*/ (*(volatile Ifx_LMU_RGNACCEN_RA*)0xF8120108u)

/** \\brief  118, LMURegion Access Enable Register 0 */
#define LMU2_RGNACCEN4_RA /*lint --e(923)*/ (*(volatile Ifx_LMU_RGNACCEN_RA*)0xF8120118u)

/** \\brief  128, LMURegion Access Enable Register 0 */
#define LMU2_RGNACCEN5_RA /*lint --e(923)*/ (*(volatile Ifx_LMU_RGNACCEN_RA*)0xF8120128u)

/** \\brief  138, LMURegion Access Enable Register 0 */
#define LMU2_RGNACCEN6_RA /*lint --e(923)*/ (*(volatile Ifx_LMU_RGNACCEN_RA*)0xF8120138u)

/** \\brief  148, LMURegion Access Enable Register 0 */
#define LMU2_RGNACCEN7_RA /*lint --e(923)*/ (*(volatile Ifx_LMU_RGNACCEN_RA*)0xF8120148u)

/** \\brief  DC, LMURegion Access Enable Register 1 */
#define LMU2_RGNACCEN0_RB /*lint --e(923)*/ (*(volatile Ifx_LMU_RGNACCEN_RB*)0xF81200DCu)

/** \\brief  EC, LMURegion Access Enable Register 1 */
#define LMU2_RGNACCEN1_RB /*lint --e(923)*/ (*(volatile Ifx_LMU_RGNACCEN_RB*)0xF81200ECu)

/** \\brief  FC, LMURegion Access Enable Register 1 */
#define LMU2_RGNACCEN2_RB /*lint --e(923)*/ (*(volatile Ifx_LMU_RGNACCEN_RB*)0xF81200FCu)

/** \\brief  10C, LMURegion Access Enable Register 1 */
#define LMU2_RGNACCEN3_RB /*lint --e(923)*/ (*(volatile Ifx_LMU_RGNACCEN_RB*)0xF812010Cu)

/** \\brief  11C, LMURegion Access Enable Register 1 */
#define LMU2_RGNACCEN4_RB /*lint --e(923)*/ (*(volatile Ifx_LMU_RGNACCEN_RB*)0xF812011Cu)

/** \\brief  12C, LMURegion Access Enable Register 1 */
#define LMU2_RGNACCEN5_RB /*lint --e(923)*/ (*(volatile Ifx_LMU_RGNACCEN_RB*)0xF812012Cu)

/** \\brief  13C, LMURegion Access Enable Register 1 */
#define LMU2_RGNACCEN6_RB /*lint --e(923)*/ (*(volatile Ifx_LMU_RGNACCEN_RB*)0xF812013Cu)

/** \\brief  14C, LMURegion Access Enable Register 1 */
#define LMU2_RGNACCEN7_RB /*lint --e(923)*/ (*(volatile Ifx_LMU_RGNACCEN_RB*)0xF812014Cu)

/** \\brief  24, LMUSafety Control Register */
#define LMU2_SCTRL /*lint --e(923)*/ (*(volatile Ifx_LMU_SCTRL*)0xF8120024u)

/** \}  */
/******************************************************************************/
/******************************************************************************/
/** \addtogroup IfxLld_Lmu_Cfg_Lmu3
 * \{  */

/** \\brief  10, LMUAccess Enable Register 0 */
#define LMU3_ACCEN0 /*lint --e(923)*/ (*(volatile Ifx_LMU_ACCEN0*)0xF8130010u)

/** \\brief  14, LMUAccess Enable Register 1 */
#define LMU3_ACCEN1 /*lint --e(923)*/ (*(volatile Ifx_LMU_ACCEN1*)0xF8130014u)

/** \\brief  0, LMUClock Control Register */
#define LMU3_CLC /*lint --e(923)*/ (*(volatile Ifx_LMU_CLC*)0xF8130000u)

