Anyc-Qing/AUTOSAR/core/system/Os/osal/tricore/aurix/TC39x_Source/IFX_base_famework/BaseFramework_TC39xA/0_Src/BaseSw/Sfr_39A/_Reg/IfxLmu_reg.h
/** \\brief  20, LMUMemory Control Register */
#define LMU3_MEMCON /*lint --e(923)*/ (*(volatile Ifx_LMU_MEMCON*)0xF8130020u)

/** \\brief  8, LMUModule ID Register */
#define LMU3_MODID /*lint --e(923)*/ (*(volatile Ifx_LMU_MODID*)0xF8130008u)

/** \\brief  58, LMURegion Access Enable Register */
#define LMU3_RGN0_ACCENWA /*lint --e(923)*/ (*(volatile Ifx_LMU_RGN_ACCENWA*)0xF8130058u)

/** \\brief  5C, LMURegion Access Enable Register */
#define LMU3_RGN0_ACCENWB /*lint --e(923)*/ (*(volatile Ifx_LMU_RGN_ACCENWB*)0xF813005Cu)

/** \\brief  50, LMURegion Lower Address Register */
#define LMU3_RGN0_LA /*lint --e(923)*/ (*(volatile Ifx_LMU_RGN_LA*)0xF8130050u)

/** \\brief  54, LMURegion Upper Address Register */
#define LMU3_RGN0_UA /*lint --e(923)*/ (*(volatile Ifx_LMU_RGN_UA*)0xF8130054u)

/** \\brief  68, LMURegion Access Enable Register */
#define LMU3_RGN1_ACCENWA /*lint --e(923)*/ (*(volatile Ifx_LMU_RGN_ACCENWA*)0xF8130068u)

/** \\brief  6C, LMURegion Access Enable Register */
#define LMU3_RGN1_ACCENWB /*lint --e(923)*/ (*(volatile Ifx_LMU_RGN_ACCENWB*)0xF813006Cu)

/** \\brief  60, LMURegion Lower Address Register */
#define LMU3_RGN1_LA /*lint --e(923)*/ (*(volatile Ifx_LMU_RGN_LA*)0xF8130060u)

/** \\brief  64, LMURegion Upper Address Register */
#define LMU3_RGN1_UA /*lint --e(923)*/ (*(volatile Ifx_LMU_RGN_UA*)0xF8130064u)

/** \\brief  78, LMURegion Access Enable Register */
#define LMU3_RGN2_ACCENWA /*lint --e(923)*/ (*(volatile Ifx_LMU_RGN_ACCENWA*)0xF8130078u)

/** \\brief  7C, LMURegion Access Enable Register */
#define LMU3_RGN2_ACCENWB /*lint --e(923)*/ (*(volatile Ifx_LMU_RGN_ACCENWB*)0xF813007Cu)

/** \\brief  70, LMURegion Lower Address Register */
#define LMU3_RGN2_LA /*lint --e(923)*/ (*(volatile Ifx_LMU_RGN_LA*)0xF8130070u)

/** \\brief  74, LMURegion Upper Address Register */
#define LMU3_RGN2_UA /*lint --e(923)*/ (*(volatile Ifx_LMU_RGN_UA*)0xF8130074u)

/** \\brief  88, LMURegion Access Enable Register */
#define LMU3_RGN3_ACCENWA /*lint --e(923)*/ (*(volatile Ifx_LMU_RGN_ACCENWA*)0xF8130088u)

/** \\brief  8C, LMURegion Access Enable Register */
#define LMU3_RGN3_ACCENWB /*lint --e(923)*/ (*(volatile Ifx_LMU_RGN_ACCENWB*)0xF813008Cu)

/** \\brief  80, LMURegion Lower Address Register */
#define LMU3_RGN3_LA /*lint --e(923)*/ (*(volatile Ifx_LMU_RGN_LA*)0xF8130080u)

/** \\brief  84, LMURegion Upper Address Register */
#define LMU3_RGN3_UA /*lint --e(923)*/ (*(volatile Ifx_LMU_RGN_UA*)0xF8130084u)

/** \\brief  98, LMURegion Access Enable Register */
#define LMU3_RGN4_ACCENWA /*lint --e(923)*/ (*(volatile Ifx_LMU_RGN_ACCENWA*)0xF8130098u)

/** \\brief  9C, LMURegion Access Enable Register */
#define LMU3_RGN4_ACCENWB /*lint --e(923)*/ (*(volatile Ifx_LMU_RGN_ACCENWB*)0xF813009Cu)

/** \\brief  90, LMURegion Lower Address Register */
#define LMU3_RGN4_LA /*lint --e(923)*/ (*(volatile Ifx_LMU_RGN_LA*)0xF8130090u)

/** \\brief  94, LMURegion Upper Address Register */
#define LMU3_RGN4_UA /*lint --e(923)*/ (*(volatile Ifx_LMU_RGN_UA*)0xF8130094u)

/** \\brief  A8, LMURegion Access Enable Register */
#define LMU3_RGN5_ACCENWA /*lint --e(923)*/ (*(volatile Ifx_LMU_RGN_ACCENWA*)0xF81300A8u)

/** \\brief  AC, LMURegion Access Enable Register */
#define LMU3_RGN5_ACCENWB /*lint --e(923)*/ (*(volatile Ifx_LMU_RGN_ACCENWB*)0xF81300ACu)

/** \\brief  A0, LMURegion Lower Address Register */
#define LMU3_RGN5_LA /*lint --e(923)*/ (*(volatile Ifx_LMU_RGN_LA*)0xF81300A0u)

/** \\brief  A4, LMURegion Upper Address Register */
#define LMU3_RGN5_UA /*lint --e(923)*/ (*(volatile Ifx_LMU_RGN_UA*)0xF81300A4u)

/** \\brief  B8, LMURegion Access Enable Register */
#define LMU3_RGN6_ACCENWA /*lint --e(923)*/ (*(volatile Ifx_LMU_RGN_ACCENWA*)0xF81300B8u)

/** \\brief  BC, LMURegion Access Enable Register */
#define LMU3_RGN6_ACCENWB /*lint --e(923)*/ (*(volatile Ifx_LMU_RGN_ACCENWB*)0xF81300BCu)

/** \\brief  B0, LMURegion Lower Address Register */
#define LMU3_RGN6_LA /*lint --e(923)*/ (*(volatile Ifx_LMU_RGN_LA*)0xF81300B0u)

/** \\brief  B4, LMURegion Upper Address Register */
#define LMU3_RGN6_UA /*lint --e(923)*/ (*(volatile Ifx_LMU_RGN_UA*)0xF81300B4u)

/** \\brief  C8, LMURegion Access Enable Register */
#define LMU3_RGN7_ACCENWA /*lint --e(923)*/ (*(volatile Ifx_LMU_RGN_ACCENWA*)0xF81300C8u)

/** \\brief  CC, LMURegion Access Enable Register */
#define LMU3_RGN7_ACCENWB /*lint --e(923)*/ (*(volatile Ifx_LMU_RGN_ACCENWB*)0xF81300CCu)

/** \\brief  C0, LMURegion Lower Address Register */
#define LMU3_RGN7_LA /*lint --e(923)*/ (*(volatile Ifx_LMU_RGN_LA*)0xF81300C0u)

/** \\brief  C4, LMURegion Upper Address Register */
#define LMU3_RGN7_UA /*lint --e(923)*/ (*(volatile Ifx_LMU_RGN_UA*)0xF81300C4u)

/** \\brief  D8, LMURegion Access Enable Register 0 */
#define LMU3_RGNACCEN0_RA /*lint --e(923)*/ (*(volatile Ifx_LMU_RGNACCEN_RA*)0xF81300D8u)

/** \\brief  E8, LMURegion Access Enable Register 0 */
#define LMU3_RGNACCEN1_RA /*lint --e(923)*/ (*(volatile Ifx_LMU_RGNACCEN_RA*)0xF81300E8u)

/** \\brief  F8, LMURegion Access Enable Register 0 */
#define LMU3_RGNACCEN2_RA /*lint --e(923)*/ (*(volatile Ifx_LMU_RGNACCEN_RA*)0xF81300F8u)

/** \\brief  108, LMURegion Access Enable Register 0 */
#define LMU3_RGNACCEN3_RA /*lint --e(923)*/ (*(volatile Ifx_LMU_RGNACCEN_RA*)0xF8130108u)

/** \\brief  118, LMURegion Access Enable Register 0 */
#define LMU3_RGNACCEN4_RA /*lint --e(923)*/ (*(volatile Ifx_LMU_RGNACCEN_RA*)0xF8130118u)

/** \\brief  128, LMURegion Access Enable Register 0 */
#define LMU3_RGNACCEN5_RA /*lint --e(923)*/ (*(volatile Ifx_LMU_RGNACCEN_RA*)0xF8130128u)

/** \\brief  138, LMURegion Access Enable Register 0 */
#define LMU3_RGNACCEN6_RA /*lint --e(923)*/ (*(volatile Ifx_LMU_RGNACCEN_RA*)0xF8130138u)

/** \\brief  148, LMURegion Access Enable Register 0 */
#define LMU3_RGNACCEN7_RA /*lint --e(923)*/ (*(volatile Ifx_LMU_RGNACCEN_RA*)0xF8130148u)

/** \\brief  DC, LMURegion Access Enable Register 1 */
#define LMU3_RGNACCEN0_RB /*lint --e(923)*/ (*(volatile Ifx_LMU_RGNACCEN_RB*)0xF81300DCu)

/** \\brief  EC, LMURegion Access Enable Register 1 */
#define LMU3_RGNACCEN1_RB /*lint --e(923)*/ (*(volatile Ifx_LMU_RGNACCEN_RB*)0xF81300ECu)

/** \\brief  FC, LMURegion Access Enable Register 1 */
#define LMU3_RGNACCEN2_RB /*lint --e(923)*/ (*(volatile Ifx_LMU_RGNACCEN_RB*)0xF81300FCu)

/** \\brief  10C, LMURegion Access Enable Register 1 */
#define LMU3_RGNACCEN3_RB /*lint --e(923)*/ (*(volatile Ifx_LMU_RGNACCEN_RB*)0xF813010Cu)

/** \\brief  11C, LMURegion Access Enable Register 1 */
#define LMU3_RGNACCEN4_RB /*lint --e(923)*/ (*(volatile Ifx_LMU_RGNACCEN_RB*)0xF813011Cu)

/** \\brief  12C, LMURegion Access Enable Register 1 */
#define LMU3_RGNACCEN5_RB /*lint --e(923)*/ (*(volatile Ifx_LMU_RGNACCEN_RB*)0xF813012Cu)

/** \\brief  13C, LMURegion Access Enable Register 1 */
#define LMU3_RGNACCEN6_RB /*lint --e(923)*/ (*(volatile Ifx_LMU_RGNACCEN_RB*)0xF813013Cu)

/** \\brief  14C, LMURegion Access Enable Register 1 */
#define LMU3_RGNACCEN7_RB /*lint --e(923)*/ (*(volatile Ifx_LMU_RGNACCEN_RB*)0xF813014Cu)

/** \\brief  24, LMUSafety Control Register */
#define LMU3_SCTRL /*lint --e(923)*/ (*(volatile Ifx_LMU_SCTRL*)0xF8130024u)
/** \}  */
/******************************************************************************/
/******************************************************************************/
#endif /* IFXLMU_REG_H */
